# ResetSlabShape Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
SlabShapeEditor..::..ResetSlabShape Method
SlabShapeEditor Class Example See Also
---
Removes the modifications made during editing and resets the element geometry back to the unmodified state.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public void ResetSlabShape()
```

Visual Basic
---
```text
Public Sub ResetSlabShape
```

Visual C++
---
```text
public:
void ResetSlabShape()
```

# Remarks
Calling this method will reset the slab back to its original state and disable Slab Shape Editing. If further editing is needed, call Enable again.
# Examples
CopyC#
```text
private void ResetSlabShapes(Autodesk.Revit.DB.Document document)
{
    UIDocument uidoc = new UIDocument(document);
    ICollection<ElementId> selectedIds = uidoc.Selection.GetElementIds();
    foreach (ElementId id in selectedIds)
    {
        Floor floor = document.GetElement(id) as Floor;
        if (floor != null)
        {
            SlabShapeEditor slabShapeEditor = floor.SlabShapeEditor;
            slabShapeEditor.ResetSlabShape();
        }
    }

}
```

CopyVB.NET
```text
Private Sub ResetSlabShapes(document As Autodesk.Revit.DB.Document)
    Dim uidoc As New UIDocument(document)
    Dim selectedIds As ICollection(Of ElementId) = uidoc.Selection.GetElementIds()
    For Each id As ElementId In selectedIds
        Dim floor As Floor = TryCast(document.GetElement(id), Floor)
        If floor IsNot Nothing Then
            Dim slabShapeEditor As SlabShapeEditor = floor.SlabShapeEditor
            slabShapeEditor.ResetSlabShape()
        End If
    Next

End Sub
```

# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace